# 4회 기출 변형

- 작업 3유형 통계 반영

# 작업 1유형

```{attention} 
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv**
월마트 판매량 데이터 : https://www.kaggle.com/datasets/asahu40/walmart-data-analysis-and-forcasting
```

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv")

```{admonition} 1-1
**Temperature컬럼에서 숫자가 아닌 문자들을 제거후 숫자 타입으로 바꾸고 3분위수에서 1분위수의 차이를 소숫점 이하 2자리까지 구하여라**
```

In [18]:
df['Temperature'] = df['Temperature'].str.replace("*", '').astype('float')
ans = round(df['Temperature'].quantile(0.75) - df['Temperature'].quantile(0.25), 2)
print(ans)

27.48

```{attention} 
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv**
유튜브 영상 통계량 : https://www.kaggle.com/datasets/advaypatil/youtube-statistics?select=videos-stats.csv
```

In [19]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv")

```{admonition} 1-2
**Likes를 Comments로 나눈 비율이 20이상이면서 Keyword값이 minecraft인 영상들의 Views값의 평균을 정수로 구하여라**
```

In [33]:
df['ratio'] = df['Likes'] / df['Comments']
ans = int(df[( df['ratio'] >= 20 ) & ( df['Keyword'] == "minecraft" )].Views.mean())
print(ans)

1789084

```{attention} 
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv**
넷플릭스 영상 메타정보 : https://www.kaggle.com/datasets/akashguna/netflix-prize-shows-information
```

In [34]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv")

```{admonition} 1-3
**date_added가 2018년 1월 이면서 country가 United Kingdom 단독 제작인 데이터의 갯수**
```

In [74]:
df['date_added'] = pd.to_datetime(df['date_added'])
df['year'] = df['date_added'].dt.year
df['month'] = df['date_added'].dt.month
ans = len(df[ (df['year'] == 2018 ) & ( df['month'] == 1 ) & (df['country'] == 'United Kingdom')])
print(ans)

6

# 작업 2유형

```{attention} 
유저 분류 : https://www.kaggle.com/datasets/kaushiksuresh147/customer-segmentation
**train = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv**
**test = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv**

예측 변수 Segmentation, test.csv에 대해 ID별로 Segmentation의 클래스를 예측해서 저장후 제출, 제출 데이터 컬럼은 ID와 Segmentation 두개만 존재해야함. 평가지표는 macro f1 score
```

In [10]:
import pandas as pd
X_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv')
y_train = X_train.pop('Segmentation').to_frame()
X_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv')

display(X_train.head())
display(y_train.head())
display(X_test.head())

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,464357,Male,No,40,Yes,Artist,7.0,Low,1.0,Cat_6
1,459624,Male,No,18,No,Healthcare,NaN,Low,5.0,Cat_4
2,462672,Male,No,25,No,Healthcare,7.0,Low,4.0,Cat_4
3,463360,Female,Yes,46,Yes,Artist,2.0,Low,1.0,Cat_6
4,462420,Male,No,27,Yes,Healthcare,1.0,Low,3.0,Cat_6

  Segmentation
0            A
1            D
2            D
3            B
4            C

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,460406,Male,Yes,36,Yes,Healthcare,3.0,Low,2.0,Cat_6
1,466890,Male,Yes,47,Yes,Artist,0.0,Average,6.0,Cat_7
2,466145,Male,Yes,56,No,Entertainment,1.0,Average,3.0,Cat_6
3,465805,Male,Yes,50,Yes,Engineer,NaN,Low,1.0,Cat_3
4,466137,Female,NaN,31,No,Healthcare,0.0,Low,4.0,Cat_6

# 작업 3유형

```{attention} 
어느 대학교의 신입생의 학과별 성별에 대한 데이터이다.
**DataUrl = https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv**
**이 데이터를 바탕으로, 학생들의 학과와 성별이 서로 독립적인지 여부를 확인하기 위해 카이제곱 독립성 검정을 실시 하려한다.**
```

In [75]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv")

```{admonition} 3-1-a
**학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라**
```

In [87]:
ans = round(len(df) / df.nunique().학과, 3)
print(ans)

170.333

```{admonition} 3-1-b
**카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라**
```

In [109]:
from scipy.stats import chi2_contingency
tmp = df.groupby(['학과','성별']).size().to_frame('합계').unstack()

s, p, dof, expected = chi2_contingency(tmp)

ans = round(s, 3)

print(ans)

5.646

In [113]:
crosstab = pd.crosstab(df['학과'], df['성별'])
display(crosstab)
display(tmp)

성별       남    여
학과
경영학과   150  171
경제학과    79   91
기계공학과  125  119
사회학과    48   51
의학과     32   27
전자공학과   74   55

        합계
성별       남    여
학과
경영학과   150  171
경제학과    79   91
기계공학과  125  119
사회학과    48   51
의학과     32   27
전자공학과   74   55

```{admonition} 3-1-c
**카이제곱검정 독립성 검정의 pvalue를 소숫점 이하 3자리까지 구하여라. 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 것을 출력하라**
```

In [115]:
ans = round(p, 3)
print(ans, "귀무가설 채택")

0.342 귀무가설 채택